### 1. 112 서버 (TEAM4_PARAM_TABLE) 테이블 활용 MA_WINDOW를 이동평균 구간으로 설정

In [1]:
from PrintImport import PrintDbEngine

In [2]:
PrintDbEngine()

import psycopg2                          # PostgreSQL을 사용 가능하게 해준다.
import pymysql                           # MariaDB를 사용 가능하게 해준다.
import cx_Oracle                         # Oracle을 사용 가능하게 해준다.
from sqlalchemy import create_engine     # DB 접속 엔진을 만들어준다.

# AWS PostgreSQL 데이터베이스 접속 엔진 생성.
aws_postgresql_url = 'postgresql://haiteam:haiteam@www.hadoopkorea.com:5432/postgres'
engine_postgresql = create_engine(aws_postgresql_url)

# AWS MariaDB 데이터베이스 접속 엔진 생성.
aws_mariadb_url = 'mysql+pymysql://kopo:kopo@www.hadoopkorea.com:3306/kopo'
engine_mariadb = create_engine(aws_mariadb_url)

# 학교 Oracle 데이터베이스 접속 엔진 생성.
kopo_oracle_url = 'oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl'
engine_kopo_oracle = create_engine(kopo_oracle_url)

In [3]:
import pandas as pd
import cx_Oracle
from sqlalchemy import create_engine

# 엔진 생성
oracleEngine = 'oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl'

# inplace를 했을 때 warning이 발생. 실제 에러는 아니고 경고이므로 보기 싫으면 이렇게 넣어주면 된다.
import warnings

warnings.filterwarnings(action="ignore")

# DB 읽어오기
TEAM4_PARAM_TABLE = pd.read_sql_query('SELECT * FROM TEAM4_PARAM_TABLE', oracleEngine)

TEAM4_PARAM_TABLE

,category,param_name,param_seq,param_value,use_yn,note
0,COMMON,VALID_WEEK,1,52,Y,[유효 주차수] 해당 주차수 범위 내의 데이터만 분석함
1,COMMON,MA_WINDOW,1,9,Y,[이동평균구간] 판매량 이동평균 산출용
2,COMMON,MA_SMTH_WINDOW,1,5,Y,[이동평균구간] 평균판매량 스무딩용
3,COMMON,MSTD_WINDOW,1,5,Y,[이동표준편차구간] MA에 대한 이동표준편차 산출용

In [4]:
ma_window = int(TEAM4_PARAM_TABLE.param_value[TEAM4_PARAM_TABLE.param_name == 'MA_WINDOW'].values)

In [5]:
type(ma_window)

int

### 2. 위 데이터베이스를 활용하여 kopo_channel_seasonality_new.csv 파일의 (지역/상품별 평균 판매량)의 이동평균 값을 산출하세요.

In [6]:
# 1. 데이터를 불러온 후 정렬한다.
import pandas as pd

In [7]:
url = '../exampleCode/dataset/kopo_channel_seasonality_new.csv'
selloutData = pd.read_csv(url)
selloutData

       REGIONID    PRODUCT  YEARWEEK      QTY
0           A60   PRODUCT4    201402     71.0
1           A60  PRODUCT59    201402  22275.0
2           A60  PRODUCT34    201402   4463.0
3           A60  PRODUCT47    201402      0.0
4           A60  PRODUCT56    201402     23.0
...         ...        ...       ...      ...
124653      A10  PRODUCT60    201630    824.0
124654      A10  PRODUCT56    201630    275.0
124655      A10  PRODUCT61    201630      0.0
124656      A10  PRODUCT12    201630  15021.0
124657      A10   PRODUCT1    201630    568.0

[124658 rows x 4 columns]

In [8]:
# 정렬을 해보자
sortKey = ['REGIONID','PRODUCT','YEARWEEK']
sortedData = selloutData.sort_values(sortKey, ignore_index=True)
sortedData

       REGIONID    PRODUCT  YEARWEEK     QTY
0           A00  PRODUCT34    201401   661.0
1           A00  PRODUCT34    201402   679.0
2           A00  PRODUCT34    201403   578.0
3           A00  PRODUCT34    201404   532.0
4           A00  PRODUCT34    201405   516.0
...         ...        ...       ...     ...
124653      A77  PRODUCT12    201648  4152.0
124654      A77  PRODUCT12    201649  5086.0
124655      A77  PRODUCT12    201650  5846.0
124656      A77  PRODUCT12    201651  4933.0
124657      A77  PRODUCT12    201652  7551.0

[124658 rows x 4 columns]

In [9]:
# 2. 그룹데이터를 만들어 그룹별로 분리시키는 함수를 만든다.
groupKey = ['REGIONID','PRODUCT']
groupData = sortedData.groupby(groupKey)

In [10]:
groupDataList = list(groupData.groups)
# groupDataList

In [11]:
groupDataList[0]

('A00', 'PRODUCT34')

In [12]:
eachGroup = groupData.get_group(groupDataList[0])
eachGroup

    REGIONID    PRODUCT  YEARWEEK    QTY
0        A00  PRODUCT34    201401  661.0
1        A00  PRODUCT34    201402  679.0
2        A00  PRODUCT34    201403  578.0
3        A00  PRODUCT34    201404  532.0
4        A00  PRODUCT34    201405  516.0
..       ...        ...       ...    ...
152      A00  PRODUCT34    201648   17.0
153      A00  PRODUCT34    201649   19.0
154      A00  PRODUCT34    201650   35.0
155      A00  PRODUCT34    201651   73.0
156      A00  PRODUCT34    201652   22.0

[157 rows x 4 columns]

In [13]:
def groupma(eachGroup):
    # 디버깅 코드
#     eachGroup = groupData.get_group(groupDataList[0])
    eachGroup["MA"] = eachGroup.QTY.rolling(window=ma_window, center=True, min_periods=1).mean()
    
    return eachGroup

In [14]:
# 3. 2에서 구한 함수를 적용해서 이동평균을 구한다.
groupResult = sortedData.groupby(groupKey).apply(groupma)
groupResult

       REGIONID    PRODUCT  YEARWEEK     QTY           MA
0           A00  PRODUCT34    201401   661.0   593.200000
1           A00  PRODUCT34    201402   679.0   564.833333
2           A00  PRODUCT34    201403   578.0   542.285714
3           A00  PRODUCT34    201404   532.0   520.000000
4           A00  PRODUCT34    201405   516.0   514.444444
...         ...        ...       ...     ...          ...
124653      A77  PRODUCT12    201648  4152.0  4890.222222
124654      A77  PRODUCT12    201649  5086.0  4987.875000
124655      A77  PRODUCT12    201650  5846.0  5056.714286
124656      A77  PRODUCT12    201651  4933.0  5190.333333
124657      A77  PRODUCT12    201652  7551.0  5513.600000

[124658 rows x 5 columns]

In [4]:
import cx_Oracle
from sqlalchemy import create_engine
import pandas as pd

# 엔진 생성
oracleEngine = 'oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl'

# inplace를 했을 때 warning이 발생. 실제 에러는 아니고 경고이므로 보기 싫으면 이렇게 넣어주면 된다.
import warnings

warnings.filterwarnings(action="ignore")

# DB 읽어오기
paramData = pd.read_sql_query('SELECT * FROM TEAM4_PARAM_TABLE', oracleEngine)

paramData

,category,param_name,param_seq,param_value,use_yn,note
0,COMMON,VALID_WEEK,1,52,Y,[유효 주차수] 해당 주차수 범위 내의 데이터만 분석함
1,COMMON,MA_WINDOW,1,9,Y,[이동평균구간] 판매량 이동평균 산출용
2,COMMON,MA_SMTH_WINDOW,1,5,Y,[이동평균구간] 평균판매량 스무딩용
3,COMMON,MSTD_WINDOW,1,5,Y,[이동표준편차구간] MA에 대한 이동표준편차 산출용

In [5]:
aa = paramData.loc[(paramData.param_name=="MA_WINDOW"),"param_value"]

In [7]:
MA_WINDOW = int(aa)
MA_WINDOW

9

# 5-1 데이터 분석 및 데이터 전처리 파트 1 P.86

join_region_master.csv, join_kopo_product_volume.csv, joinMaster, joinSellout 변수에 담으세요.

In [1]:
import pandas as pd

url1 = '../exampleCode/dataset/join_region_master.csv'
url2 = '../exampleCode/dataset/join_kopo_product_volume.csv'

joinMaster = pd.read_csv(url1, encoding='cp949')
joinSellout = pd.read_csv(url2, encoding='cp949')

In [2]:
joinMaster

  REGIONID REGIONNAME
0      A01         한국
1      A02         미국
2      A03        프랑스
3      A04         독일

In [3]:
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [4]:
pd.merge(joinMaster,joinSellout)

  REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0      A01         한국  ST0001    201901  3000
1      A01         한국  ST0001    201902  3500
2      A02         미국  ST0002    201901  4000
3      A02         미국  ST0003    201902  7000

In [5]:
pd.merge(joinMaster,joinSellout,left_on="REGIONID",right_on="REGIONID")    # 기본키를 이용해 붙인다.

  REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0      A01         한국  ST0001    201901  3000
1      A01         한국  ST0001    201902  3500
2      A02         미국  ST0002    201901  4000
3      A02         미국  ST0003    201902  7000

In [6]:
pd.merge(joinMaster,joinSellout,how='inner')

  REGIONID REGIONNAME PRODUCT  YEARWEEK   QTY
0      A01         한국  ST0001    201901  3000
1      A01         한국  ST0001    201902  3500
2      A02         미국  ST0002    201901  4000
3      A02         미국  ST0003    201902  7000

In [7]:
pd.merge(joinMaster,joinSellout,how='outer')

  REGIONID REGIONNAME PRODUCT  YEARWEEK     QTY
0      A01         한국  ST0001  201901.0  3000.0
1      A01         한국  ST0001  201902.0  3500.0
2      A02         미국  ST0002  201901.0  4000.0
3      A02         미국  ST0003  201902.0  7000.0
4      A03        프랑스     NaN       NaN     NaN
5      A04         독일     NaN       NaN     NaN

In [8]:
joinMaster

  REGIONID REGIONNAME
0      A01         한국
1      A02         미국
2      A03        프랑스
3      A04         독일

In [9]:
apData = pd.DataFrame([['A01','KOREA']], columns=['REGIONID','REGIONNAME'])
apData

  REGIONID REGIONNAME
0      A01      KOREA

In [15]:
joinSellout

  REGIONID PRODUCT  YEARWEEK   QTY
0      A01  ST0001    201901  3000
1      A01  ST0001    201902  3500
2      A02  ST0002    201901  4000
3      A02  ST0003    201902  7000

In [10]:
apData.rename(columns={"REGIONID":"SALESID"}, inplace=True)

In [11]:
pd.concat([joinMaster, apData], axis = 0)

  REGIONID REGIONNAME SALESID
0      A01         한국     NaN
1      A02         미국     NaN
2      A03        프랑스     NaN
3      A04         독일     NaN
0      NaN      KOREA     A01

In [12]:
pd.merge(joinSellout,apData,left_on='REGIONID',right_on='SALESID')

  REGIONID PRODUCT  YEARWEEK   QTY SALESID REGIONNAME
0      A01  ST0001    201901  3000     A01      KOREA
1      A01  ST0001    201902  3500     A01      KOREA

In [13]:
pd.merge(joinSellout,apData,left_on='REGIONID',right_on='SALESID', how='left')

  REGIONID PRODUCT  YEARWEEK   QTY SALESID REGIONNAME
0      A01  ST0001    201901  3000     A01      KOREA
1      A01  ST0001    201902  3500     A01      KOREA
2      A02  ST0002    201901  4000     NaN        NaN
3      A02  ST0003    201902  7000     NaN        NaN

In [14]:
pd.merge(joinSellout,apData,left_on='REGIONID',right_on='SALESID', how='right')

  REGIONID PRODUCT  YEARWEEK   QTY SALESID REGIONNAME
0      A01  ST0001    201901  3000     A01      KOREA
1      A01  ST0001    201902  3500     A01      KOREA